# DBSQLExecuteNext

## Description
Moves the resultSet current pointer to the next entry.

```pascal
FUNCTION DBSQLExecuteNext(resultSetInst : LONGINT): BOOLEAN;
```

```python
def vs.DBSQLExecuteNext(resultSetInst):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|resultSetInst|LONGINT|   |

## Examples
[[VS:DBSQLExecuteDSN]]

## Version
Availability: from Vectorworks 2011

## Category
* ODBC